{
    "alpinejs": {
        "name": "Alpine.js",
        "description": "Alpine.js is a lightweight JavaScript framework that provides a minimal and expressive way to add interactivity to web pages. It is designed to be easy to learn and use, allowing developers to create dynamic user interfaces with minimal code. Alpine.js is often compared to larger frameworks like Vue.js and React, but it focuses on simplicity and small size, making it ideal for adding interactivity to static HTML pages.",
        "tags": [
            "web_framework",
            "javascript"
        ],
        "link": "https://alpinejs.dev/",
        "developer": "Caleb Porzio",
        "selectors": [
            "script[src*='alpinejs']",
            "[x-html]"
        ],
        "html": [
            "\\bx-on:click=",
            "\\bx-bind:class="
        ]
    },
    "angular": {
        "name": "Angular",
        "description": "Angular is a comprehensive, open-source web application framework developed and maintained by Google LLC for building modern, scalable, and high-performance single-page applications (SPAs). It is a complete platform that uses a component-based architecture and TypeScript, a statically-typed superset of JavaScript, to enhance code quality and maintainability.",
        "tags": [
            "web_framework",
            "javascript",
            "typescript"
        ],
        "link": "https://angular.dev/",
        "developer": "Google LLC",
        "selectors": [
            "script[src*='angular']",
            "[ng-version]",
            "[ng-app-id]",
            "router-outlet",
            "#ng-state"
        ],
        "html": [
            "_ngcontent-ng"
        ],
        "headers": [
            "\\bangular"
        ]
    },
    "aurelia": {
        "name": "Aurelia",
        "description": "Aurelia is a modern, front-end JavaScript framework for building desktop, mobile, and web applications. It focuses on simplicity, convention over configuration, and a modular design, making it easy to learn and extend.",
        "tags": [
            "web_framework",
            "javascript"
        ],
        "link": "https://aurelia.io/",
        "developer": "Aurelia Core Team",
        "selectors": [
            "script[src*='aurelia']"
        ],
        "headers": [
            "\\baurelia\\b"
        ]
    },
    "backbone": {
        "name": "Backbone.js",
        "description": "Backbone.js is a lightweight JavaScript library that provides structure to web applications by offering models with key-value binding and custom events, collections with a rich API of enumerable functions, views with declarative event handling, and connects it all with your existing API using a RESTful JSON interface. It is known for its simplicity and flexibility.",
        "tags": [
            "web_framework",
            "javascript"
        ],
        "link": "https://backbonejs.org/",
        "developer": "Jeremy Ashkenas",
        "selectors": [
            "script[src*='backbone']"
        ],
        "headers": [
            "\\bbackbone"
        ]
    },
    "ember": {
        "name": "Ember.js",
        "description": "Ember.js is a productive, ambitious JavaScript framework for building modern web applications. It is designed for building complex, long-lived web applications and provides a strong convention-over-configuration approach, integrated tooling, and a focus on developer productivity.",
        "tags": [
            "web_framework",
            "javascript"
        ],
        "link": "https://emberjs.com/",
        "developer": "Ember Core Team",
        "selectors": [
            "script[src*='/ember']",
            ".ember-application"
        ],
        "headers": [
            "\\bember"
        ]
    },
    "gatsby": {
        "name": "Gatsby",
        "description": "Gatsby is a modern, open-source static site generator and web framework built on top of React and GraphQL. It is designed to create highly performant, secure, and scalable websites by pre-rendering all pages into static HTML files during the build process. This approach results in exceptionally fast load times and a better user experience, as the browser can serve the pre-built files directly without needing to query a database or run server-side code on every request.",
        "tags": [
            "web_framework",
            "javascript",
            "static_site_generator",
            "react",
            "graphql"
        ],
        "link": "https://www.gatsbyjs.com/",
        "developer": "Gatsby, Inc.",
        "selectors": [
            "#___gatsby",
            "script[src*='gatsby']"
        ],
        "headers": [
            "\\bgatsby"
        ]
    },
    "knockout": {
        "name": "Knockout.js",
        "description": "Knockout.js is a JavaScript library that helps you create rich, responsive display and editor user interfaces with a clean underlying data model. Any changes you make to your data model are automatically reflected in your UI.",
        "tags": [
            "web_framework",
            "javascript"
        ],
        "link": "https://knockoutjs.com/",
        "developer": "Steven Sanderson",
        "selectors": [
            "script[src*='knockout']"
        ],
        "headers": [
            "\\bknockout"
        ]
    },
    "mootools": {
        "name": "MooTools",
        "description": "MooTools is a compact, modular, object-oriented JavaScript framework designed for the experienced JavaScript developer. It allows you to write powerful, flexible, and cross-browser code with ease.",
        "tags": [
            "web_framework",
            "javascript"
        ],
        "link": "https://mootools.net/",
        "developer": "MooTools team",
        "selectors": [
            "script[src*='mootools']"
        ],
        "headers": [
            "\\bmootools"
        ]
    },
    "polymer": {
        "name": "Polymer",
        "description": "Polymer is an open-source JavaScript library developed by Google that allows developers to create and reuse custom HTML elements, known as Web Components. It is designed to make it easier to build modular, maintainable, and interoperable web applications by leveraging the latest web standards. Polymer provides a set of features for creating custom elements with their own templates, styles, and logic, promoting a component-driven approach to web development.",
        "tags": [
            "web_framework",
            "javascript"
        ],
        "link": "https://www.polymer-project.org/",
        "developer": "The Polymer Authors",
        "selectors": [
            "script[src*='polymer']"
        ]
    },
    "ractivejs": {
        "name": "Ractive.js",
        "description": "Ractive.js is a template-driven UI library that transforms templates, styles, and logic into blueprints for highly interactive apps.",
        "tags": [
            "web_framework",
            "javascript"
        ],
        "link": "https://ractive.js.org/",
        "developer": "RactiveJS contributors",
        "selectors": [
            "script[src*='/ractive']"
        ]
    },
    "react": {
        "name": "React",
        "description": "React is a free and open-source front-end JavaScript library for building user interfaces or UI components. It is maintained by Meta and a community of individual developers and companies. React can be used as a base in the development of single-page, mobile, or server-rendered applications with frameworks like Next.js. Because it is component-based, it allows for the creation of reusable UI components.",
        "tags": [
            "web_framework",
            "javascript"
        ],
        "link": "https://reactjs.org/",
        "developer": "Meta",
        "selectors": [
            "script[src*='/react']",
            "[data-reactroot]",
            "[data-reactid]",
            "#react-root"
        ],
        "headers": [
            "\\breact\\b"
        ]
    },
    "riotjs": {
        "name": "Riot.js",
        "description": "Riot.js is a simple and elegant component-based UI library that allows developers to build user interfaces with custom tags. It is known for its minimal and lightweight nature, providing a simple and enjoyable syntax that is easy to learn. Riot.js aims to provide a powerful yet minimalistic toolset for creating reusable components with a clean and readable structure.",
        "tags": [
            "web_framework",
            "javascript"
        ],
        "link": "https://riot.js.org/",
        "developer": "Riot.js community",
        "selectors": [
            "script[src*='riot']"
        ]
    },
    "nextjs": {
        "name": "Next.js",
        "description": "Next.js is a popular open-source React framework created by Vercel that enables developers to build high-performance, server-rendered, and static web applications with ease. It provides a powerful set of features out-of-the-box, including server-side rendering (SSR), static site generation (SSG), file-system based routing, and API routes, which simplifies the development of complex and scalable full-stack applications. By handling much of the configuration and tooling, Next.js allows developers to focus on writing application code while benefiting from optimized performance and a great developer experience.",
        "link": "https://nextjs.org/",
        "tags": [
            "web_framework",
            "javascript",
            "react"
        ],
        "developer": "Vercel",
        "selectors": [
            "#__NEXT_DATA__",
            "#__next",
            "#next-route-announcer",
            "nextid",
            "script[src*='_next/static/chunks']",
            "[data-next-head-count]",
            "meta[name='next-head-count']"
        ],
        "headers": [
            "\\bNext[.]js",
            "next-router"
        ]
    },
    "nuxt": {
        "name": "Nuxt",
        "link": "https://nuxt.com/",
        "description": "Nuxt.js is a free and open-source web application framework based on Vue.js, Node.js, Webpack and Babel. It provides a powerful and intuitive way to create universal (server-side rendered) or single-page Vue.js applications.",
        "tags": [
            "web_framework",
            "javascript"
        ],
        "developer": "Nuxt Team",
        "selectors": [
            "script[src*='/_nuxt/']",
            "#__nuxt"
        ],
        "headers": [
            "\\bnuxt\\b"
        ]
    },
    "vue": {
        "name": "Vue.js",
        "link": "https://vuejs.org/",
        "description": "Vue.js is an open-source model-view-viewmodel front end JavaScript framework for building user interfaces and single-page applications. It's known for its progressive adoption, allowing developers to integrate it incrementally into existing projects.",
        "tags": [
            "web_framework",
            "javascript"
        ],
        "developer": "Evan You and Vue.js contributors",
        "selectors": [
            "script[src*='/vue']"
        ],
        "headers": [
            "\\bvue\\b"
        ]
    },
    "svelte": {
        "name": "Svelte",
        "link": "https://svelte.dev/",
        "description": "Svelte is a modern, open-source JavaScript framework for building user interfaces. It distinguishes itself from other popular frameworks like React and Vue by shifting the bulk of its work into a compile step, rather than performing it in the browser at runtime.",
        "tags": [
            "web_framework",
            "javascript"
        ],
        "developer": "Svelte contributors",
        "html": [
            "__sveltekit_"
        ],
        "selectors": [
            "#svelte-announcer",
            "[data-sveltekit-preload-data]",
            "[class*='svelte-']"
        ],
        "headers": [
            "\\bsvelte"
        ]
    },
    "preact": {
        "name": "Preact",
        "link": "https://preactjs.com/",
        "description": "Preact is a fast, lightweight, and efficient JavaScript library for building user interfaces. It is designed to be a smaller alternative to React, providing a similar API and component-based architecture while significantly reducing the size of the library. Preact is ideal for performance-critical applications and projects where minimizing bundle size is a priority.",
        "tags": [
            "web_framework",
            "javascript"
        ],
        "developer": "Jason Miller and Preact contributors",
        "selectors": [
            "script[type='__PREACT_CLI_DATA__']",
            "script[src*='/preact']",
            "#prerender-data"
        ],
        "headers": [
            "\\bpreact\\b"
        ]
    },
    "jquery": {
        "name": "jQuery",
        "link": "https://jquery.com/",
        "description": "jQuery is a fast, small, and feature-rich JavaScript library. It makes things like HTML document traversal and manipulation, event handling, animation, and Ajax much simpler with an easy-to-use API that works across a multitude of browsers.",
        "tags": [
            "javascript"
        ],
        "developer": "OpenJS Foundation",
        "selectors": [
            "script[src*='jquery']"
        ]
    },
    "sass": {
        "name": "Sass",
        "link": "https://sass-lang.com/",
        "description": "Sass (Syntactically Awesome Stylesheets) is a preprocessor scripting language that is interpreted or compiled into Cascading Style Sheets (CSS). SassScript is the scripting language itself. Sass consists of two syntaxes: the original indented syntax called \"Sass\" and the newer \"SCSS\" (Sassy CSS).",
        "tags": [
            "css"
        ],
        "developer": "Hampton Catlin, Michael \"Mike\" Bianchi, Chris Eppstein",
        "selectors": [
            "link[href*='.scss']",
            "link[href*='.sass']"
        ]
    },
    "webpack": {
        "name": "Webpack",
        "link": "https://webpack.js.org/",
        "description": "Webpack is a powerful and flexible open-source JavaScript module bundler. It takes modules with dependencies and generates static assets representing those modules. Webpack is highly configurable and supports a wide range of plugins and loaders, making it suitable for complex web applications that require efficient asset management and optimization.",
        "tags": [
            "build_tool"
        ],
        "developer": "",
        "selectors": [
            "script[src*='webpack']"
        ],
        "html": [
            "__webpack_require__",
            "webpackJsonp",
            "webpackChunk"
        ]
    },
    "parcel": {
        "name": "Parcel",
        "link": "https://parceljs.org/",
        "description": "Parcel is a web application bundler designed to simplify the development process with a zero-configuration setup out of the box. It offers features found in more advanced bundlers while focusing on ease of use, making it ideal for developers seeking a quick start.",
        "tags": [
            "build_tool"
        ],
        "developer": "",
        "selectors": [
            "script[src*='parcel']"
        ],
        "html": [
            "parcelRequire",
            "parcelHotUpdate"
        ]
    },
    "vite": {
        "name": "Vite",
        "link": "https://vite.dev/",
        "description": "Vite is a modern frontend build tool designed for speed and simplicity. It provides an efficient and streamlined development experience, especially for modern JavaScript frameworks.",
        "tags": [
            "build_tool"
        ],
        "developer": "",
        "selectors": [
            "script[src*='/vite']",
            "script[src*='@vite']"
        ],
        "html": [
            "\\bvite/client",
            " data-v-\\w{8}"
        ]
    },
    "ga": {
        "name": "Google Analytics",
        "link": "https://analytics.google.com/",
        "description": "Google Analytics is a web analytics service offered by Google that tracks and reports website traffic, currently as a platform inside the Google Marketing Platform brand. It helps businesses understand user behavior and optimize their online presence.",
        "tags": [
            "analytics"
        ],
        "developer": "Google",
        "html": [
            "google-analytics[.]com"
        ],
        "selectors": [
            "script[src*='google-analytics.com']"
        ]
    },
    "gtm": {
        "name": "Google Tag Manager",
        "description": "Google Tag Manager is a tag management system that allows you to quickly and easily update tracking codes and related code fragments known as \"tags\" on your website or mobile app. This helps in managing marketing and analytics tags without directly modifying website code.",
        "link": "https://tagmanager.google.com/",
        "developer": "Google LLC",
        "tags": [
            "analytics"
        ],
        "html": [
            "googletagmanager[.]com"
        ],
        "selectors": [
            "script[src*='googletagmanager.com']",
            "iframe[src*='googletagmanager.com']"
        ]
    },
    "tailwindcss": {
        "name": "Tailwind CSS",
        "description": "Tailwind CSS is a utility-first CSS framework for rapidly building custom user interfaces. Instead of predefined components, it provides low-level utility classes that you can combine to build any design directly in your markup.",
        "link": "https://tailwindcss.com/",
        "tags": [
            "css"
        ],
        "developer": "Adam Wathan, Steve Schoger, and the Tailwind CSS team",
        "html": [
            "tailwindcss"
        ],
        "selectors": [
            "script[src*='tailwindcss']",
            "link[href*='tailwindcss']"
        ]
    },
    "bootstrap": {
        "name": "Bootstrap",
        "description": "Bootstrap is a popular open-source frontend toolkit for developing responsive and mobile-first websites. It provides a collection of CSS and JavaScript tools, including a grid system, pre-designed components, and utilities that help developers quickly create modern web interfaces.",
        "tags": [
            "css"
        ],
        "link": "https://getbootstrap.com/",
        "developer": "Bootstrap Authors",
        "html": [
        ],
        "selectors": [
            "link[href*='bootstrap']",
            "script[src*='bootstrap']"
        ]
    },
    "chakraui": {
        "name": "Chakra UI",
        "description": "Chakra UI is a simple, modular, and accessible component library for React applications. It provides a set of accessible and composable React components that make it easy to build UIs quickly.",
        "tags": [
            "css"
        ],
        "developer": "Segun Adebayo",
        "html": [
            "chakraui",
            "--chakra-"
        ],
        "link": "https://chakra-ui.com/",
        "selectors": [
            "style[data-emotion*='chakra']",
            "div[class*='chakra-']"
        ]
    },
    "daisyui": {
        "description": "daisyUI is a Tailwind CSS component library that adds a set of component classes to Tailwind CSS, making it easier to build common UI elements with pre-styled designs.",
        "name": "daisyUI",
        "tags": [
            "css"
        ],
        "developer": "Pouya Saadeghi",
        "link": "https://daisyui.com/",
        "selectors": [
            "script[src*='daisyui']",
            "link[href*='daisyui']"
        ]
    },
    "flyonui": {
        "description": "FlyonUI is a modern component library built on top of Tailwind CSS. It provides a collection of pre-designed, customizable UI components that help developers quickly build responsive and visually appealing web applications using Tailwind CSS.",
        "name": "FlyonUI",
        "tags": [
            "css"
        ],
        "developer": "ThemeSelection",
        "link": "https://flyonui.com/",
        "selectors": [
            "script[src*='flyonui']",
            "link[href*='flyonui']"
        ]
    },
    "oxbowui": {
        "description": "Oxbow UI is a modern component library built on top of Tailwind CSS. It provides a collection of pre-designed, customizable UI components that help developers quickly build responsive and visually appealing web applications using Tailwind CSS.",
        "name": "Oxbow UI",
        "tags": [
            "css"
        ],
        "developer": "Unwrapped",
        "link": "https://oxbowui.com/",
        "selectors": [
            "script[src*='oxbowui']",
            "link[href*='oxbowui']"
        ]
    },
    "mantine": {
        "description": "Mantine is a modern React component library that provides a wide range of customizable and accessible UI components and hooks. It is designed to help developers build responsive and visually appealing web applications quickly and efficiently.",
        "name": "Mantine",
        "tags": [
            "css",
            "react"
        ],
        "developer": "Vitaly Rtishchev",
        "link": "https://mantine.dev/",
        "selectors": [
            "script[src*='mantine']",
            "link[href*='mantine']"
        ]
    },
    "shadcn": {
        "description": "shadcn/ui is a collection of accessible, reusable, and composable React components built with Radix UI and styled with Tailwind CSS. It provides a set of pre-designed components that can be easily integrated into React applications to speed up development and ensure consistency in design.",
        "name": "shadcn/ui",
        "tags": [
            "css",
            "react"
        ],
        "developer": "shadcn",
        "link": "https://ui.shadcn.com/",
        "selectors": [
            "script[src*='shadcn']",
            "link[href*='shadcn']"
        ]
    },
    "preline": {
        "description": "Preline is a free and open-source UI component library built on top of Tailwind CSS. It provides a collection of pre-designed components and utilities that help developers quickly build responsive and modern web interfaces using Tailwind CSS.",
        "name": "Preline",
        "tags": [
            "css"
        ],
        "developer": "Khaled Garbaya",
        "link": "https://preline.co/",
        "selectors": [
            "script[src*='preline']",
            "link[href*='preline']"
        ]
    },
    "rewindui": {
        "description": "Rewind-UI is a collection of free and open-source Tailwind CSS components and templates designed to help developers quickly build modern and responsive web interfaces. It provides a variety of pre-designed components that can be easily integrated into Tailwind CSS projects.",
        "name": "Rewind-UI",
        "tags": [
            "css",
            "react"
        ],
        "developer": "Rewind UI contributors",
        "link": "https://rewindui.com/",
        "selectors": [
            "script[src*='rewindui']",
            "link[href*='rewindui']"
        ]
    },
    "flowbite": {
        "description": "Flowbite is a free and open-source component library built on top of Tailwind CSS. It provides a collection of pre-designed UI components and interactive elements that help developers quickly build responsive and modern web interfaces using Tailwind CSS.",
        "name": "Flowbite",
        "tags": [
            "css"
        ],
        "developer": "Themesberg",
        "link": "https://flowbite.com/",
        "selectors": [
            "script[src*='flowbite']",
            "link[href*='flowbite']"
        ]
    },
    "htmx": {
        "description": "HTMX is a library that allows you to access modern browser features directly from HTML, rather than using JavaScript. It enables you to build dynamic user interfaces with less JavaScript by leveraging HTML attributes for AJAX, CSS transitions, WebSockets, and Server Sent Events.",
        "name": "HTMX",
        "tags": [
            "web_framework",
            "javascript"
        ],
        "link": "https://htmx.org/",
        "developer": "Carson Gross",
        "selectors": [
            "script[src*='htmx']",
            "[hx-get]",
            "[hx-post]",
            "[hx-target]",
            "[hx-indicator]"
        ]
    },
    "nginx": {
        "description": "Nginx (engine-x) is a free, open-source, high-performance HTTP server and reverse proxy, as well as an IMAP/POP3 proxy server. It is known for its high concurrency, excellent performance, and low memory usage, making it ideal for high-traffic websites.",
        "name": "Nginx",
        "link": "https://nginx.org/",
        "tags": [
            "http_server"
        ],
        "developer": "Nginx, Inc.",
        "headers": [
            "\\bnginx"
        ]
    },
    "tengine": {
        "description": "Tengine is an open-source web server developed by Taobao, a major e-commerce platform in Asia. It is a fork of the popular Nginx HTTP server and inherits all of Nginx's features while adding a range of advanced functionalities.",
        "name": "Tengine",
        "link": "https://tengine.taobao.org/",
        "tags": [
            "http_server"
        ],
        "developer": "Alibaba Group",
        "headers": [
            "\\btengine"
        ]
    },
    "envoy": {
        "description": "Envoy is an open-source edge and service proxy, designed for cloud-native applications. It sits between your services and the outside world, handling network requests and providing advanced features like load balancing, circuit breaking, and traffic routing.",
        "name": "Envoy",
        "link": "https://www.envoyproxy.io/",
        "tags": [
            "http_server"
        ],
        "developer": "Cloud Native Computing Foundation",
        "headers": [
            "\\benvoy"
        ]
    },
    "apache": {
        "name": "Apache",
        "link": "https://httpd.apache.org/",
        "description": "Apache HTTP Server, commonly referred to as Apache, is a free and open-source cross-platform web server software. It is one of the oldest and most widely used web servers, known for its flexibility and robust feature set.",
        "tags": [
            "http_server"
        ],
        "developer": "Apache Software Foundation",
        "headers": [
            "\\bapache"
        ]
    },
    "iis": {
        "name": "IIS",
        "link": "https://www.iis.net/",
        "description": "Internet Information Services (IIS) is a flexible, secure and manageable Web server for hosting anything on the Web. It is developed by Microsoft and commonly used to host ASP.NET applications on Windows servers.",
        "tags": [
            "http_server",
            "windows"
        ],
        "developer": "Microsoft Corporation",
        "headers": [
            "\\biis\\b"
        ]
    },
    "tomcat": {
        "name": "Apache Tomcat",
        "link": "https://tomcat.apache.org/",
        "description": "Apache Tomcat is an open-source implementation of the Java Servlet, JavaServer Pages, Java Expression Language and Java WebSocket technologies. It is widely used as a servlet container for Java web applications.",
        "tags": [
            "http_server",
            "java"
        ],
        "developer": "Apache Software Foundation",
        "headers": [
            "\\btomcat",
            "Apache-Coyote"
        ]
    },
    "jetty": {
        "name": "Eclipse Jetty",
        "link": "https://www.eclipse.org/jetty/",
        "description": "Jetty is a lightweight, embeddable Java HTTP server and servlet container maintained by the Eclipse Foundation. It is commonly embedded in frameworks and applications where a small footprint and easy embedding are desirable.",
        "tags": [
            "http_server",
            "java"
        ],
        "developer": "Eclipse Foundation",
        "headers": [
            "\\bjetty"
        ]
    },
    "uwsgi": {
        "name": "uWSGI",
        "link": "https://uwsgi-docs.readthedocs.io/",
        "description": "uWSGI is a fast application server for deploying Python (and other language) web applications. It implements the uwsgi protocol and can host WSGI, PSGI, and Rack apps, commonly used behind Nginx or other web servers.",
        "tags": [
            "http_server"
        ],
        "developer": "uWSGI project",
        "headers": [
            "\\buwsgi"
        ]
    },
    "puma": {
        "name": "Puma",
        "link": "https://puma.io/",
        "description": "Puma is a simple, fast, and concurrent Ruby/Rack web server designed for speed and threading. It's widely used to serve Ruby on Rails applications in production.",
        "tags": [
            "http_server",
            "ruby",
            "rails"
        ],
        "developer": "Puma contributors",
        "headers": [
            "\\bPuma\\b"
        ]
    },
    "gunicorn": {
        "name": "Gunicorn",
        "link": "https://gunicorn.org/",
        "description": "Gunicorn is a Python WSGI (Web Server Gateway Interface) HTTP server for UNIX-like systems that is used to run web applications and handle concurrent requests by forking multiple worker processes.",
        "tags": [
            "http_server"
        ],
        "developer": "Benoît Chesneau",
        "headers": [
            "\\bgunicorn"
        ]
    },
    "passenger": {
        "name": "Phusion Passenger",
        "link": "https://www.phusionpassenger.com/",
        "description": "Phusion Passenger (Passenger) is an application server that integrates with web servers like Nginx and Apache to serve Ruby, Node.js, Python and other apps. It aims to simplify deployment and improve performance and stability.",
        "tags": [
            "http_server"
        ],
        "developer": "Phusion B.V.",
        "headers": [
            "\\bPassenger"
        ]
    },
    "lighttpd": {
        "name": "Lighttpd",
        "link": "https://www.lighttpd.net/",
        "description": "Lighttpd (lighty) is a secure, fast, and compliant web server designed for high-performance environments. It has a small memory footprint and is often used for static content and proxying to application servers.",
        "tags": [
            "http_server"
        ],
        "developer": "Lighttpd community",
        "headers": [
            "\\bLighttpd"
        ]
    },
    "caddy": {
        "name": "Caddy",
        "link": "https://caddyserver.com/",
        "description": "Caddy is an extensible, HTTP/2-ready web server with automatic HTTPS by default. It's designed for simplicity, security, and performance, and includes features like configuration via a simple Caddyfile and automatic TLS certificate management.",
        "tags": [
            "http_server"
        ],
        "developer": "Light Code Labs / Caddy maintainers",
        "headers": [
            "\\bCaddy"
        ]
    },
    "openresty": {
        "name": "OpenResty",
        "link": "https://openresty.org/",
        "description": "OpenResty (ngx_openresty) is a full-fledged web platform based on Nginx and LuaJIT. It bundles Nginx with many useful Lua libraries and extensions to build scalable web services, APIs, and dynamic web applications.",
        "tags": [
            "http_server"
        ],
        "developer": "OpenResty Inc.",
        "headers": [
            "\\bopenresty"
        ]
    },
    "express": {
        "name": "Express",
        "link": "https://expressjs.com/",
        "description": "Express.js is a minimal and flexible Node.js web application framework that provides a robust set of features for web and mobile applications. It's widely used for building APIs and web servers due to its simplicity and unopinionated nature.",
        "developer": "TJ Holowaychuk",
        "headers": [
            "\\bexpress\\b"
        ]
    },
    "varnish": {
        "name": "Varnish",
        "link": "https://varnish-cache.org/",
        "description": "Varnish Cache is an open-source HTTP accelerator designed for content-heavy dynamic websites. It acts as a reverse proxy that sits in front of your web server, caching frequently accessed content to improve website performance and reduce server load.",
        "tags": [
            "http_server"
        ],
        "developer": "Varnish Software AS",
        "headers": [
            "\\bvarnish\\b"
        ]
    },
    "google": {
        "name": "Google",
        "link": "https://about.google/",
        "description": "Google's web services or platforms, encompassing a wide range of offerings like search, cloud computing, advertising, and development tools.",
        "developer": "Google LLC",
        "headers": [
            "^server: google",
            "^server: ESF\\b",
            "^via:.*google",
            "scaffolding on HTTPServer2"
        ]
    },
    "surge": {
        "name": "Surge",
        "link": "https://surge.sh/",
        "developer": "Brock Whitten",
        "description": "Surge is a static web publishing platform that allows developers to deploy static websites quickly and easily. It provides a simple command-line interface for publishing projects, making it ideal for front-end developers and designers looking to share their work online without complex server setups.",
        "headers": [
            "\\bsurge\\b"
        ]
    },
    "vercel": {
        "name": "Vercel",
        "link": "https://vercel.com/",
        "developer": "Vercel Inc.",
        "description": "Vercel is a cloud platform for static sites and Serverless Functions, specializing in Next.js applications. It provides global deployment, serverless scaling, and a seamless developer experience for modern web projects.",
        "headers": [
            "\\bvercel"
        ]
    },
    "gae": {
        "name": "Google App Engine",
        "description": "Google App Engine (GAE) is a platform-as-a-service (PaaS) product that enables web app developers and enterprises to build, deploy and host scalable, high-performance applications in Google's fully managed cloud environment without having to worry about infrastructure provisioning or management.",
        "link": "https://cloud.google.com/appengine",
        "developer": "Google LLC",
        "headers": [
            "\\bappengine\\b"
        ]
    },
    "cloudfront": {
        "name": "Amazon CloudFront",
        "link": "https://aws.amazon.com/cloudfront/",
        "tags": [
            "cdn",
            "aws"
        ],
        "developer": "Amazon.com, Inc.",
        "description": "Amazon CloudFront is a fast content delivery network (CDN) service by Amazon Web Services (AWS). It securely delivers data, videos, applications, and APIs to customers globally with low latency and high transfer speeds.",
        "headers": [
            "\\bcloudfront\\b",
            "^x-amz-cf-",
            "^Server: CEP$",
            "^X-infrastructure: CepAws"
        ]
    },
    "f5": {
        "name": "F5",
        "link": "https://f5.com/",
        "developer": "F5, Inc.",
        "description": "F5 provides services to help manage and secure applications, ensuring they are resilient, performant, and secure across multi-cloud and hybrid environments.",
        "tags": [
            "cdn"
        ],
        "domains": [
            "\\bf5[.]com$"
        ],
        "headers": [
            "\\bvolt-adc\\b",
            "\\bVolterra"
        ]
    },
    "fastly": {
        "name": "Fastly",
        "link": "https://www.fastly.com/",
        "developer": "Fastly, Inc.",
        "description": "Fastly is a cloud computing services provider that offers a content delivery network (CDN), edge cloud platform, and web application firewall (WAF). It's known for its real-time performance and ability to run code at the edge of the network.",
        "tags": [
            "cdn"
        ],
        "domains": [
            "\\bfastly[.]net$"
        ],
        "headers": [
            "\\bfastly"
        ]
    },
    "cloudflare": {
        "name": "Cloudflare",
        "link": "https://www.cloudflare.com/",
        "developer": "Cloudflare, Inc.",
        "description": "Cloudflare is a web infrastructure and website security company that provides content delivery network services, DDoS mitigation, Internet security, and distributed domain name server services. It helps protect and accelerate websites and applications.",
        "tags": [
            "cdn"
        ],
        "selectors": [
            "script[data-cf-beacon]"
        ],
        "headers": [
            "cloudflare",
            "^cf-ray.*$",
            "^cf-mitigated.*$"
        ]
    },
    "heroku": {
        "name": "Heroku",
        "link": "https://www.heroku.com/",
        "description": "Heroku is a cloud platform as a service (PaaS) that supports several programming languages. It allows developers to deploy, run, and scale applications in the cloud, abstracting away the complexities of infrastructure management.",
        "tags": [
            "cloud"
        ],
        "developer": "Salesforce",
        "domains": [
            "herokuapp[.]com"
        ],
        "headers": [
            "heroku"
        ]
    },
    "firebase": {
        "name": "Firebase",
        "link": "https://firebase.google.com/",
        "description": "Firebase is a platform developed by Google for creating mobile and web applications. It provides a variety of tools and services, including real-time databases, authentication, cloud storage, hosting, and analytics, to help developers build high-quality apps quickly and easily.",
        "tags": [
            "cloud"
        ],
        "developer": "Google LLC",
        "domains": [
            "\\bfirebase"
        ],
        "headers": [
            "\\bfirebase"
        ]
    },
    "github": {
        "name": "GitHub",
        "link": "https://github.com/",
        "description": "GitHub is a web-based hosting service for version control using Git. It is primarily used for computer code, facilitating collaborative development and project management for software developers.",
        "tags": [
            "cloud"
        ],
        "developer": "Microsoft Corporation",
        "domains": [
            "\\bgithub"
        ],
        "headers": [
            "github"
        ]
    },
    "gitlab": {
        "name": "GitLab",
        "link": "https://gitlab.com/",
        "description": "GitLab is a web-based DevOps lifecycle tool that provides a Git repository manager with features such as issue tracking, continuous integration/continuous deployment (CI/CD), and code review. It enables teams to collaborate on software development projects efficiently.",
        "tags": [
            "cloud"
        ],
        "developer": "GitLab Inc.",
        "domains": [
            "\\bgitlab"
        ],
        "headers": [
            "\\bgitlab"
        ]
    },
    "gcp": {
        "name": "Google Cloud Platform",
        "tags": [
            "paas",
            "cloud"
        ],
        "developer": "Google LLC",
        "link": "https://cloud.google.com/",
        "description": "Google Cloud Platform (GCP) is a suite of cloud computing services that runs on the same infrastructure that Google uses internally for its end-user products, such as Google Search, Gmail, file storage, and YouTube. It offers various services like compute, storage, databases, machine learning, and more.",
        "headers": [
            "\\bgcp\\b"
        ]
    },
    "alibaba": {
        "name": "Alibaba Cloud",
        "tags": [
            "cloud"
        ],
        "link": "https://www.alibabacloud.com/",
        "developer": "Alibaba Group",
        "description": "Alibaba Cloud provides a suite of global cloud computing services including elastic compute, storage, database, networking, security, and CDN, tailored for enterprises and developers with strong presence in Asia-Pacific.",
        "headers": [
            "alibaba",
            "\bAlicloud"
        ]
    },
    "oracle": {
        "name": "Oracle Cloud Infrastructure",
        "tags": [
            "cloud"
        ],
        "link": "https://www.oracle.com/cloud/",
        "developer": "Oracle Corporation",
        "description": "Oracle Cloud Infrastructure (OCI) is Oracle's cloud offering with services for compute, storage, networking, databases (Autonomous Database), analytics, and enterprise SaaS, optimized for enterprise workloads and hybrid cloud deployments.",
        "headers": [
            "\\boracle"
        ]
    },
    "ibm": {
        "name": "IBM Cloud",
        "tags": [
            "cloud"
        ],
        "link": "https://www.ibm.com/cloud",
        "developer": "IBM Corporation",
        "description": "IBM Cloud is an enterprise-grade cloud platform providing IaaS, PaaS, and SaaS offerings including virtual servers, Kubernetes, AI/Watson services, and hybrid cloud solutions tailored for business workloads and compliance-sensitive environments."
    },
    "digitalocean": {
        "name": "DigitalOcean",
        "tags": [
            "cloud"
        ],
        "link": "https://www.digitalocean.com/",
        "developer": "DigitalOcean, Inc.",
        "description": "DigitalOcean offers simple, developer-friendly cloud infrastructure and managed services (Droplets, Managed Kubernetes, Managed Databases, object storage) targeted at small-to-medium teams and startups seeking straightforward cloud hosting.",
        "headers": [
            "digitalocean",
            "\\bdo-server",
            "^X-Gateway: Edge-Gateway",
            "^X-Do-",
            "^Do-Upstream-Service-Time"
        ]
    },
    "railway": {
        "name": "Railway",
        "tags": [
            "cloud"
        ],
        "link": "https://railway.app/",
        "developer": "Railway Corp.",
        "description": "Railway is a cloud platform that simplifies the deployment and management of applications and databases. It provides an intuitive interface and automation tools to help developers focus on building their projects without worrying about infrastructure.",
        "headers": [
            "\\brailway"
        ]
    },
    "render": {
        "name": "Render",
        "tags": [
            "cloud"
        ],
        "link": "https://render.com/",
        "developer": "Render Inc.",
        "description": "Render is a unified cloud platform that makes it easy to build and run applications and websites with free SSL, a global CDN, private networks, and auto-deploys from Git. It aims to simplify the deployment process for developers.",
        "headers": [
            "\\brender"
        ]
    },
    "aws": {
        "name": "Amazon Web Services",
        "tags": [
            "cloud"
        ],
        "link": "https://aws.amazon.com/",
        "developer": "Amazon.com, Inc.",
        "description": "Amazon Web Services (AWS) is a comprehensive, broadly adopted, and widely used cloud platform, offering over 200 fully featured services from data centers globally. It provides a vast array of services for compute, storage, databases, analytics, machine learning, and more.",
        "headers": [
            "\\bAWSALB\\b",
            "^x-amz-",
            "AmazonS3"
        ]
    },
    "azure": {
        "name": "Microsoft Azure",
        "link": "https://azure.microsoft.com/",
        "tags": [
            "cloud"
        ],
        "developer": "Microsoft Corporation",
        "description": "Microsoft Azure, commonly referred to as Azure, is a cloud computing service operated by Microsoft for application management via Microsoft-managed data centers. It provides a wide range of services for building, deploying, and managing applications and services.",
        "headers": [
            "\\bazure"
        ]
    },
    "aspnet": {
        "name": "ASP.NET",
        "link": "https://dotnet.microsoft.com/",
        "tags": [
            "web_framework",
            "csharp"
        ],
        "developer": "Microsoft Corporation",
        "description": "A framework for building web apps and services with .NET and C#.",
        "headers": [
            "\\basp[.]net",
            "\\bAspnet\\b",
            "\\bkestrel"
        ]
    },
    "akamai": {
        "name": "Akamai",
        "link": "https://www.akamai.com/",
        "tags": [
            "cdn"
        ],
        "developer": "Akamai Technologies, Inc.",
        "description": "Akamai Technologies is a content delivery network (CDN) and cloud services company that provides a global network of servers to deliver web content and applications quickly and securely. It focuses on web performance, security, and media delivery.",
        "headers": [
            "\\bAkamai"
        ]
    },
    "keycdn": {
        "name": "KeyCDN",
        "link": "https://www.keycdn.com/",
        "tags": [
            "cdn"
        ],
        "developer": "proinity LLC",
        "description": "KeyCDN is a high-performance content delivery network (CDN) service designed for developers and businesses. It offers fast content delivery, real-time analytics, and easy integration with a global network of edge servers.",
        "headers": [
            "\\bKeyCDN"
        ]
    },
    "bunnycdn": {
        "name": "BunnyCDN",
        "link": "https://bunnycdn.com/",
        "tags": [
            "cdn"
        ],
        "developer": "BunnyCD, Inc.",
        "description": "BunnyCDN is a cost-effective content delivery network (CDN) with global edge locations. It offers high-performance delivery, video streaming, image optimization, and DDoS protection with competitive pricing.",
        "headers": [
            "\\bBunnyCDN"
        ]
    },
    "cachefly": {
        "name": "CacheFly",
        "link": "https://www.cachefly.com/",
        "tags": [
            "cdn"
        ],
        "developer": "CacheFly, Inc.",
        "description": "CacheFly is a high-performance content delivery network (CDN) specializing in video streaming, large file delivery, and media distribution. It offers predictable pricing, unlimited bandwidth, and support for all file types.",
        "headers": [
            "\\bCacheFly"
        ]
    },
    "cdn77": {
        "name": "CDN77",
        "link": "https://www.cdn77.com/",
        "tags": [
            "cdn"
        ],
        "developer": "CDN77, Inc.",
        "description": "CDN77 is a content delivery network (CDN) service offering fast content delivery, video streaming, image optimization, and DDoS protection with a focus on affordability and ease of use.",
        "headers": [
            "\\bCDN77"
        ]
    },
    "cdnetworks": {
        "name": "CDNetworks",
        "link": "https://www.cdnetworks.com/",
        "tags": [
            "cdn"
        ],
        "developer": "CDNetworks, Inc.",
        "description": "CDNetworks is a global content delivery network (CDN) and web security company providing high-speed content delivery, video streaming, and DDoS protection services across Asia, Europe, and North America.",
        "headers": [
            "\\bCDNetworks"
        ]
    },
    "lumen": {
        "name": "Lumen",
        "link": "https://www.lumen.com/en-us/home.html",
        "tags": [
            "cdn",
            "cloud"
        ],
        "developer": "Lumen Technologies, Inc.",
        "description": "Lumen (formerly CenturyLink) is a cloud and network infrastructure company providing a range of services including content delivery, edge computing, connectivity, security, and managed services for enterprises and service providers globally.",
        "headers": [
            "\\bLumen"
        ]
    },
    "belugacdn": {
        "name": "BelugaCDN",
        "link": "https://www.belugacdn.com/",
        "tags": [
            "cdn"
        ],
        "developer": "BelugaCDN",
        "description": "BelugaCDN is a content delivery network (CDN) service providing fast content delivery, video streaming, and web acceleration with a focus on performance and reliability.",
        "headers": [
            "\\bBeluga"
        ]
    },
    "gcore": {
        "name": "Gcore",
        "link": "https://gcore.com/",
        "tags": [
            "cdn", "cloud"
        ],
        "developer": "G-Core Labs S.A.",
        "description": "Gcore is a global cloud and edge platform providing a range of services including content delivery, video streaming, DDoS protection, edge computing, cloud infrastructure, and web security solutions for enterprises and developers worldwide.",
        "headers": [
            "\\bG-Core|\\bGcore"
        ]
    },
    "netlify": {
        "name": "Netlify",
        "tags": [
            "cloud"
        ],
        "link": "https://www.netlify.com/",
        "developer": "Netlify, Inc.",
        "description": "Netlify is a web developer platform that unifies the entire workflow for building, deploying, and scaling high-performance web applications. It offers continuous deployment, serverless functions, and a global CDN for modern web projects.",
        "headers": [
            "Netlify"
        ]
    },
    "php": {
        "name": "PHP",
        "tags": [
            "language",
            "php"
        ],
        "link": "https://www.php.net/",
        "developer": "The PHP Group",
        "description": "A popular general-purpose scripting language that is especially suited to web development.",
        "headers": [
            "\\bphp\\b"
        ]
    },
    "python": {
        "name": "Python",
        "tags": [
            "language",
            "python"
        ],
        "link": "https://www.python.org/",
        "developer": "Python Software Foundation",
        "description": "Python is a high-level, interpreted, general-purpose programming language known for its simplicity, readability, and versatility. It is widely used in web development, data science, machine learning, artificial intelligence, and scientific computing. Python emphasizes code readability and allows developers to express concepts in fewer lines of code than traditional programming languages.",
        "headers": [
            "\\bpython"
        ]
    },
    "java": {
        "name": "Java",
        "tags": [
            "language",
            "java"
        ],
        "link": "https://www.java.com/",
        "developer": "Oracle Corporation",
        "description": "Java is a high-level, object-oriented, general-purpose programming language designed to have as few implementation dependencies as possible. It is widely used for building robust, scalable server-side applications, Android mobile apps, and enterprise software. Java emphasizes portability through its 'write once, run anywhere' principle, with code compiled to bytecode that runs on the Java Virtual Machine (JVM).",
        "headers": [
            "\\bjava\\b",
            "\\bservlet\\b"
        ]
    },
    "cakephp": {
        "name": "CakePHP",
        "tags": [
            "web_framework",
            "php"
        ],
        "link": "https://cakephp.org/",
        "developer": "Cake Software Foundation, Inc.",
        "description": "CakePHP is an open-source web framework written in PHP, which follows the model-view-controller (MVC) architectural pattern. It provides a structured and rapid development environment for building web applications.",
        "headers": [
            "cakephp"
        ]
    },
    "symfony": {
        "name": "Symfony",
        "tags": [
            "web_framework",
            "php"
        ],
        "link": "https://symfony.com/",
        "developer": "SensioLabs",
        "description": "Symfony is a PHP web application framework and a set of reusable PHP components/libraries. It provides a robust architecture for building complex web applications, emphasizing performance and flexibility.",
        "html": [
            "<!--\\s*symfony"
        ],
        "headers": [
            "symfony"
        ]
    },
    "zendframework": {
        "name": "Zend Framework",
        "tags": [
            "web_framework",
            "php"
        ],
        "developer": "Zend Technologies",
        "link": "https://framework.zend.com/",
        "description": "Zend Framework is an open-source, object-oriented web application framework for PHP. It provides a collection of professional PHP packages that are used to build web applications and services.",
        "headers": [
            "\\bZend\\b"
        ]
    },
    "fuelphp": {
        "name": "FuelPHP",
        "tags": [
            "web_framework",
            "php"
        ],
        "link": "https://fuelphp.com/",
        "developer": "FuelPHP Development Team",
        "description": "FuelPHP is a fast, simple, and flexible PHP 5.3+ web framework with a strong emphasis on community and code usability. It offers an MVC pattern and a hierarchical model-view-controller (HMVC) pattern.",
        "headers": [
            "FuelPHP"
        ]
    },
    "codeigniter": {
        "name": "CodeIgniter",
        "tags": [
            "web_framework",
            "php"
        ],
        "link": "https://codeigniter.com/",
        "developer": "British Columbia Institute of Technology",
        "description": "CodeIgniter is an open-source software rapid development web framework, for use in building dynamic web sites with PHP. It's known for its small footprint, exceptional performance, and clear documentation.",
        "selectors": [
            "script[src*='codeigniter']",
            "meta[name='generator'][content*='CodeIgniter']"
        ],
        "headers": [
            "CodeIgniter"
        ]
    },
    "yii": {
        "name": "Yii",
        "tags": [
            "web_framework",
            "php"
        ],
        "link": "https://www.yiiframework.com/",
        "developer": "Yii Development Team",
        "description": "Yii is a high-performance, component-based PHP framework for rapidly developing large-scale Web applications. It promotes clean, DRY (Don't Repeat Yourself) code and comes with a rich set of features.",
        "html": [
            "yiiBaseUrl",
            "yiiSearchVersion"
        ],
        "selectors": [
            "script[src*='yii.js']",
            "script[src*='yii-']",
            "meta[name='generator'][content*='Yii']"
        ],
        "headers": [
            "\\bYii\\b"
        ]
    },
    "prado": {
        "name": "PRADO",
        "tags": [
            "web_framework",
            "php"
        ],
        "description": "PRADO is a component-based and event-driven PHP framework for developing Web applications. It emphasizes rapid development and clean code by using a modular architecture and promoting reusability.",
        "link": "https://www.pradoframework.net/site/",
        "developer": "Qiang Xue",
        "html": [
            "<!--\\s*powered\\s+by\\s+prado",
            "PRADO_PAGESTATE",
            "Prado[.]WebUI"
        ],
        "selectors": [
            "input[name='PRADO_PAGESTATE']",
            "script[src*='prado']"
        ],
        "headers": [
            "\\bPRADO\\b"
        ]
    },
    "laravel": {
        "name": "Laravel",
        "tags": [
            "web_framework",
            "php"
        ],
        "link": "https://laravel.com/",
        "description": "Laravel is a free and open-source GPL-licensed PHP web framework, designed for the development of web applications following the model-view-controller (MVC) architectural pattern. It's known for its elegant syntax, extensive features, and large community support.",
        "developer": "Taylor Otwell",
        "headers": [
            "\\blaravel"
        ],
        "selectors": [
            "meta[name='generator'][content*='Laravel']",
            "script[src*='laravel']"
        ]
    },
    "drupal": {
        "name": "Drupal",
        "description": "Drupal is a free and open-source content management system (CMS) that allows users to easily create, manage, and publish content on the web. It is highly flexible and scalable, making it suitable for a wide range of websites, from personal blogs to large enterprise applications. Drupal is known for its robust features, modularity, and strong community support.",
        "tags": [
            "php",
            "cms"
        ],
        "link": "https://www.drupal.org/",
        "developer": "Drupal Association",
        "html": [
            " data-drupal-"
        ],
        "headers": [
            "\\bdrupal"
        ],
        "selectors": [
            "[data-drupal-selector]",
            "script[src*='/sites/default/files/js/']",
            "meta[name='generator'][content*='Drupal']"
        ]
    },
    "typo3": {
        "name": "TYPO3",
        "description": "TYPO3 is a free and open-source enterprise content management system (CMS) written in PHP. It is known for its extensive feature set, flexibility, and scalability, making it suitable for complex websites and digital platforms. TYPO3 offers powerful multi-site management, workflow capabilities, and a strong focus on security and performance.",
        "tags": [
            "php",
            "cms"
        ],
        "link": "https://typo3.org/",
        "developer": "TYPO3 GmbH",
        "headers": [
            "\\btypo3"
        ],
        "selectors": [
            "meta[name='generator'][content*='TYPO3']",
            "script[src*='typo3']",
            "link[href*='typo3']",
            "typo3-universal"
        ]
    },
    "joomla": {
        "name": "Joomla!",
        "description": "Joomla! is a free and open-source content management system (CMS) for publishing web content. It is built on a model-view-controller web application framework and is widely used for various types of websites, including corporate websites, online magazines, e-commerce sites, and social networking platforms. Joomla! offers a user-friendly interface and a large ecosystem of extensions.",
        "tags": [
            "php",
            "cms"
        ],
        "link": "https://www.joomla.org/",
        "developer": "Open Source Matters, Inc.",
        "headers": [
            "\\bjoomla"
        ],
        "selectors": [
            "script[src*='joomla']",
            "script[class*='joomla-script-options']",
            "link[href*='joomla']",
            "meta[name='generator'][content*='Joomla']"
        ]
    },
    "django": {
        "name": "Django",
        "tags": [
            "web_framework",
            "python"
        ],
        "link": "https://www.djangoproject.com/",
        "developer": "Django Software Foundation",
        "description": "Django is a high-level Python web framework that encourages rapid development and clean, pragmatic design. It is built on the \"Don't Repeat Yourself\" (DRY) principle and provides a comprehensive set of tools and features for building complex, database-driven web applications quickly. Django is known for its \"batteries included\" approach, offering an ORM, admin panel, and authentication system out-of-the-box.",
        "headers": [
            "\\bDjango"
        ],
        "selectors": [
            "input[name='csrfmiddlewaretoken']",
            "script[src*='django']"
        ]
    },
    "flask": {
        "name": "Flask",
        "tags": [
            "web_framework",
            "python"
        ],
        "link": "https://flask.palletsprojects.com/",
        "developer": "Pallets",
        "description": "Flask is a lightweight, flexible, and extensible Python web framework for building web applications. It follows the micro-framework philosophy, providing only the essentials while allowing developers to choose their own tools and libraries. Flask is known for its simplicity, ease of learning, and ability to quickly prototype and deploy web applications.",
        "headers": [
            "\\bFlask"
        ]
    },
    "spring": {
        "name": "Spring Framework",
        "tags": [
            "web_framework",
            "java"
        ],
        "link": "https://spring.io/",
        "developer": "VMWare Tanzu",
        "description": "Spring Framework is a comprehensive, open-source Java framework for building enterprise-grade applications. It provides infrastructure support for developing Java applications with features like dependency injection, aspect-oriented programming, and transaction management. Spring is widely used for building RESTful web services, microservices, and complex enterprise applications, offering a robust ecosystem including Spring Boot, Spring Cloud, and Spring Data.",
        "headers": [
            "\\bspring"
        ]
    },
    "rails": {
        "name": "Ruby on Rails",
        "tags": [
            "web_framework",
            "ruby"
        ],
        "link": "https://rubyonrails.org/",
        "developer": "Rails Core Team",
        "description": "Ruby on Rails (Rails) is a server-side web application framework written in Ruby. It emphasizes convention over configuration (CoC) and the DRY (Don't Repeat Yourself) principle, providing a set of defaults and tools that speed up development of database-backed web applications. Rails includes components for routing, database access (Active Record), and view rendering, and it powers many production web apps and startups.",
        "headers": [
            "\\brails\\b"
        ]
    },
    "reflex": {
        "name": "Reflex",
        "tags": [
            "web_framework",
            "python"
        ],
        "link": "https://reflex.dev/",
        "developer": "Anyscale",
        "description": "Reflex.dev is an open-source, full-stack Python framework for web applications, integrating frontend and backend logic in Python. It utilizes an event-driven architecture and compiles the frontend into a React-based single-page application, with a backend built on FastAPI. Reflex seeks to simplify web development for Python developers using a single-language solution, avoiding the need for JavaScript or web development expertise. Reflex additionally provides a hosting service, Reflex Cloud, offering custom domains and website analytics. Reviews commend Reflex for its ease of use, speed, and consolidation of frameworks.",
        "selectors": [
            "script[src*='_reflex']",
            "script[src*='reflex_client.js']"
        ],
        "headers": [
            "\\breflex"
        ]
    },
    "masonite": {
        "description": "Masonite is a modern and developer-centric Python web framework that focuses on simplicity, elegance, and rapid development. It follows an MVC (Model-View-Controller) architecture and provides a clean API for building web applications and APIs. Masonite emphasizes ease of use and offers features like an ORM, routing, and templating engine.",
        "name": "Masonite",
        "tags": [
            "web_framework",
            "python"
        ],
        "link": "https://docs.masoniteproject.com/",
        "developer": "Masonite Community",
        "headers": [
            "Masonite"
        ],
        "selectors": [
            "script[src*='masonite']",
            "meta[name='generator'][content*='Masonite']"
        ]
    },
    "turbogears": {
        "description": "TurboGears is a Python web application framework designed for rapid web development. It is a full-stack framework that integrates various components, including an ORM (SQLAlchemy), templating engine (Jinja2 or Kid), and routing. TurboGears aims to provide a balance between convention and flexibility, allowing developers to choose the tools that best fit their needs.",
        "name": "TurboGears",
        "tags": [
            "web_framework",
            "python"
        ],
        "link": "https://turbogears.org/",
        "developer": "TurboGears Community",
        "headers": [
            "TurboGears"
        ],
        "html": [
            "<!--\\s*TurboGears\\s*-->"
        ],
        "selectors": [
            "script[src*='turbogears']",
            "meta[name='generator'][content*='TurboGears']"
        ]
    },
    "web2py": {
        "name": "web2py",
        "tags": [
            "web_framework",
            "python"
        ],
        "link": "http://www.web2py.com/",
        "developer": "Massimo Di Pierro",
        "description": "web2py is a free, open-source web framework for agile development, written in Python. It emphasizes simplicity and ease of use, offering a complete development environment including a web server, database abstraction layer, and IDE. web2py focuses on security, automatically preventing common vulnerabilities like cross-site scripting and SQL injection.",
        "headers": [
            "\\bweb2py"
        ],
        "selectors": [
            "script[src*='web2py']"
        ]
    },
    "framer": {
        "name": "Framer",
        "tags": [
            "cms"
        ],
        "description": "Framer is a design and prototyping tool that also functions as a web development framework, allowing designers to build interactive prototypes and functional websites with React components. It bridges the gap between design and code, enabling the creation of high-fidelity user interfaces with real data and complex interactions. Framer aims to streamline the handover from design to development.",
        "link": "http://www.framer.com/",
        "developer": "Framer B.V.",
        "selectors": [
            "meta[name='generator'][content*='Framer']",
            "meta[name='framer-search-index']",
            "meta[content*='framerusercontent.com']",
            "script[src*='framer']",
            "[data-framer-css-ssr-minified]",
            "[data-framer-components]",
            "[data-framer-css]",
            "[data-framer-hydrate-v2]",
            "[data-framer-generated-page]"
        ],
        "headers": [
            "\\bframer\\b"
        ]
    },
    "squarespace": {
        "name": "Squarespace",
        "tags": [
            "cms"
        ],
        "link": "https://www.squarespace.com/",
        "developer": "Squarespace, Inc.",
        "description": "Squarespace is a popular website builder and hosting service that allows individuals and businesses to create professional-looking websites without coding. It offers a drag-and-drop interface, customizable templates, and integrated e-commerce functionalities, making it easy to build portfolios, online stores, and blogs. Squarespace focuses on design aesthetics and user-friendliness.",
        "headers": [
            "Squarespace"
        ],
        "selectors": [
            "script[src*='squarespace']",
            "meta[name='generator'][content*='Squarespace']"
        ]
    },
    "unbounce": {
        "name": "Unbounce",
        "tags": [
            "cms"
        ],
        "link": "https://unbounce.com/",
        "developer": "Unbounce Marketing Solutions Inc.",
        "description": "Unbounce is a landing page platform that enables marketers to build, publish, and A/B test custom landing pages without IT hassle. It provides a drag-and-drop builder, a wide range of templates, and conversion optimization tools to help businesses generate leads and sales. Unbounce is designed to empower marketers to create high-converting campaigns quickly.",
        "headers": [
            "Unbounce"
        ],
        "html": [
            "\\bunbounce[.]com/\\w+/"
        ],
        "selectors": [
            "script[src*='unbounce.com']",
            "[class*='ub-page-overlay']"
        ]
    },
    "webflow": {
        "name": "Webflow",
        "tags": [
            "web_framework",
            "cms"
        ],
        "link": "https://webflow.com/",
        "developer": "Webflow, Inc.",
        "description": "Webflow is a no-code visual web design and CMS platform that allows users to design, build, and launch responsive websites without writing code. It provides a drag-and-drop interface, built-in CMS, and hosting capabilities, making it a popular choice for designers and marketers.",
        "headers": [
            "\\bWebflow"
        ],
        "selectors": [
            "script[src*='webflow.js']",
            "[data-wf-page]",
            "[data-wf-site]"
        ]
    },
    "wix": {
        "name": "Wix",
        "description": "Wix is a cloud-based web development platform that allows users to create websites and mobile sites through the use of online drag and drop tools. It provides a wide range of templates, apps, and features for building various types of websites, from personal portfolios to online stores.",
        "tags": [
            "cms"
        ],
        "link": "https://www.wix.com/",
        "developer": "Wix.com Ltd.",
        "headers": [
            "\\bwix\\b"
        ],
        "selectors": [
            "script[src*='wix.com']",
            "script[src*='static.parastorage.com']",
            "meta[name='generator'][content*='Wix.com']"
        ]
    },
    "wordpress": {
        "name": "WordPress",
        "description": "WordPress is a free and open-source content management system (CMS) written in PHP and paired with a MySQL or MariaDB database. It is the most popular CMS in the world, powering millions of websites, and offers a flexible platform for creating blogs, websites, and applications with a vast ecosystem of themes and plugins.",
        "tags": [
            "cms",
            "php"
        ],
        "link": "https://wordpress.com/",
        "developer": "WordPress.com",
        "headers": [
            "\\bWordPress"
        ],
        "selectors": [
            "link[href*='wp-content']",
            "link[href*='wp-includes']",
            "link[href*='wp-emoji-release']",
            "script[src*='wp-content']",
            "script[src*='wp-includes']",
            "meta[name='generator'][content*='WordPress']"
        ]
    }
}